In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.Series([0, 1, 2, 3, 4, 5, np.nan, 6, 7, 8])

In [3]:
data

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
5    5.0
6    NaN
7    6.0
8    7.0
9    8.0
dtype: float64

In [4]:
data.isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
8    False
9    False
dtype: bool

In [5]:
data.notnull()

0     True
1     True
2     True
3     True
4     True
5     True
6    False
7     True
8     True
9     True
dtype: bool

In [6]:
data.dropna()

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
5    5.0
7    6.0
8    7.0
9    8.0
dtype: float64

In [7]:
not_null_data = data.dropna()

In [8]:
data_dim = pd.DataFrame([[1,2,3,np.nan],[4,5,np.nan,np.nan],[7,np.nan,np.nan,np.nan],[np.nan,np.nan,np.nan,np.nan]])
data_dim

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  NaN NaN
2  7.0  NaN  NaN NaN
3  NaN  NaN  NaN NaN

In [9]:
data_dim.dropna()

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [10]:
data_dim.dropna(how='all')

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  NaN NaN
2  7.0  NaN  NaN NaN

In [11]:
data_dim.dropna(axis=1, how='all')

     0    1    2
0  1.0  2.0  3.0
1  4.0  5.0  NaN
2  7.0  NaN  NaN
3  NaN  NaN  NaN

In [13]:
data_dim.dropna(thresh=4)

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [14]:
data_dim.dropna(thresh=2)

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  NaN NaN

In [15]:
data_dim

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  NaN NaN
2  7.0  NaN  NaN NaN
3  NaN  NaN  NaN NaN

In [16]:
data_dim_fill = data_dim.fillna(0)

In [17]:
data_dim_fill

     0    1    2    3
0  1.0  2.0  3.0  0.0
1  4.0  5.0  0.0  0.0
2  7.0  0.0  0.0  0.0
3  0.0  0.0  0.0  0.0

In [18]:
data_dim_fill = data_dim.fillna({0: 0, 1: 8, 2: 9, 3: 10})
data_dim_fill

     0    1    2     3
0  1.0  2.0  3.0  10.0
1  4.0  5.0  9.0  10.0
2  7.0  8.0  9.0  10.0
3  0.0  8.0  9.0  10.0

In [19]:
data_dim_fill = data_dim.fillna(method='ffill', limit = 2)
data_dim_fill

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  3.0 NaN
2  7.0  5.0  3.0 NaN
3  7.0  5.0  NaN NaN

In [20]:
data_dim_fill = data_dim.fillna(method='ffill', limit = 3)
data_dim_fill

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  3.0 NaN
2  7.0  5.0  3.0 NaN
3  7.0  5.0  3.0 NaN

In [21]:
data_dim_fill = data_dim.fillna(axis = 1, method='ffill', limit=2)
data_dim_fill

     0    1    2    3
0  1.0  2.0  3.0  3.0
1  4.0  5.0  5.0  5.0
2  7.0  7.0  7.0  NaN
3  NaN  NaN  NaN  NaN

In [22]:
data_dim

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  NaN NaN
2  7.0  NaN  NaN NaN
3  NaN  NaN  NaN NaN

In [23]:
data_dim_fill = data_dim.fillna(data_dim.mean())
data_dim_fill

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  3.0 NaN
2  7.0  3.5  3.0 NaN
3  4.0  3.5  3.0 NaN

In [24]:
data = pd.Series([1,2,-99,4,5,-99,7,8,-99])
data

0     1
1     2
2   -99
3     4
4     5
5   -99
6     7
7     8
8   -99
dtype: int64

In [25]:
data.replace(-99, np.nan)

0    1.0
1    2.0
2    NaN
3    4.0
4    5.0
5    NaN
6    7.0
7    8.0
8    NaN
dtype: float64

In [26]:
data.replace([-99, 7.0, 8.0], np.nan)

0    1.0
1    2.0
2    NaN
3    4.0
4    5.0
5    NaN
6    NaN
7    NaN
8    NaN
dtype: float64

In [27]:
data.replace({-99: np.nan, 1.0: 0.0})

0    0.0
1    2.0
2    NaN
3    4.0
4    5.0
5    NaN
6    7.0
7    8.0
8    NaN
dtype: float64

In [28]:
data_number = pd.DataFrame({'english': ['zero','one','two','three','four','five'],
'digits': [0,1,2,3,4,5]})
data_number

  english  digits
0    zero       0
1     one       1
2     two       2
3   three       3
4    four       4
5    five       5

In [29]:
english_to_multiple = {
    'two': 'yes',
    'four': 'yes'
}

In [30]:
english_to_multiple

{'two': 'yes', 'four': 'yes'}

In [31]:
data_number['multiple'] = data_number['english'].map(english_to_multiple)

In [32]:
data_number

  english  digits multiple
0    zero       0      NaN
1     one       1      NaN
2     two       2      yes
3   three       3      NaN
4    four       4      yes
5    five       5      NaN

In [34]:
data = pd.Series(list('abcdababcdabcd'))
data

0     a
1     b
2     c
3     d
4     a
5     b
6     a
7     b
8     c
9     d
10    a
11    b
12    c
13    d
dtype: object

In [35]:
pd.get_dummies(data)

    a  b  c  d
0   1  0  0  0
1   0  1  0  0
2   0  0  1  0
3   0  0  0  1
4   1  0  0  0
5   0  1  0  0
6   1  0  0  0
7   0  1  0  0
8   0  0  1  0
9   0  0  0  1
10  1  0  0  0
11  0  1  0  0
12  0  0  1  0
13  0  0  0  1

In [ ]:
"""
a = 0
b = 1
c = 2
d = 3
"""
"""
Methods to change categorical variables to continuous variables(numerical values)
1. Get dummies() 
    problems - data size will increase, hard to get these values in one column, multi-colinearity, linear dependence
2. Replace
    df.replace({'a':0, 'b':1, 'c':2, 'd':3})
    problem - lengthy process of typing while a lot of categories
3. Label Encoder
    It is always the best choice to convert categorical values to continuous. 
"""
# Hotdog : 0
# Pizza: 1
# Burgur : 2
# Chicken : 3

In [37]:
# sklearn - scikit learn - Machine learning and Pre Processing Library
from sklearn.preprocessing import LabelEncoder

In [38]:
# Label Encoder Object or Estimator
le = LabelEncoder()

In [39]:
data = le.fit_transform(data)

In [40]:
data

array([0, 1, 2, 3, 0, 1, 0, 1, 2, 3, 0, 1, 2, 3])

In [ ]:
# Normalization and Standardization

In [ ]:
#Miles driven- 100, 1000, 10000, 10000000 .. Range is 100 to 10000000
#Price- 50k - 100k

In [ ]:
# Normalizing - Convert or Scale all these values in a range of 0 - 1.. Range will be 0 to 1
# Normalize Miles driven
# Normalize Price

In [ ]:
# Miles driven - 0 to 1
# prices- 0 to 1